DeviceInfo
| where isnotempty(DeviceId)
| summarize arg_max(Timestamp, OSPlatform, DeviceName) by DeviceId
| join kind=inner (
    DeviceTvmInfoGathering
    | where isnotempty(AdditionalFields)
    | extend ParsedFields = parse_json(AdditionalFields)
    | extend AvPlatformVersion = tostring(ParsedFields.AvPlatformVersion)
    | extend AvPlatformVersionUpToDate = tostring(ParsedFields.AvIsPlatformUptodate)
    | where isnotempty(AvPlatformVersion)
    | summarize arg_max(Timestamp, AvPlatformVersion, AvPlatformVersionUpToDate) by DeviceId
) on DeviceId
| project 
    DeviceName,
    OSPlatform,
    AvPlatformVersion,
    AvPlatformVersionUpToDate = case(
        AvPlatformVersionUpToDate == "true", "Yes",
        AvPlatformVersionUpToDate == "false", "No",
        "Unknown"
    )
| sort by DeviceName asc
